Revit 2026 API

# HermiteSurface Methods

---

The HermiteSurface type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create(Int32, Int32, IListXYZ) |  |
|  | Create(Int32, Int32, IListXYZ, Boolean, Boolean) |  |
|  | Dispose | (Inherited from Surface) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBoundingBoxUV | Gets the UV bounding box of the surface. (Inherited from Surface) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValid | Checks whether this HermiteSurface object is valid. |
|  | Project | Project a 3D point orthogonally onto a surface (to find the nearest point). Throws InvalidOperationException if the projection fails. (Inherited from Surface) |
|  | ProjectWithGuessPoint | Project a 3D point orthogonally onto a surface (to find the nearest point). This method is meant to be used when a good approximate solution for the projection is available. Throws InvalidOperationException if the projection fails. (Inherited from Surface) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

HermiteSurface Class

Autodesk.Revit.DB Namespace